{
    "name": "Delegations and Advanced Metadata Implementation",
    "summary": "OS-UP#1 introduces two major updates and a few minor ones to the EthOS ecosystem, with a focus on Delegations and the EthOS Organization. \n **Delegations 2.0**\n**Major Update 1**\nThis introduces a new insurance feature to the Delegations Manager that will force Delegations to stake tokens ($OS, for EthOS Organization Delegations) as insurance if they want to compete for grant money; they will only receive the insurance back if they act honestly.\n**Minor Updates**\n- Items, ERC20s and ERC1155s Organization governance tokens will all be wrappable in exchange for Delegation tokens (more here https://docs.ethos.wiki/ethereansos-docs/guilds/guilds-documentation/delegations/delegations-governance/delegationtokensmanager).\n- Delegation proposals will include an additional metadata field in which to convey proposal information.\n**EthOS Organization**\n**Major Update #2**\nAccompanying Major Update #1, this will introduce a new survey-less subDAO through which $OS holders will govern the amount of $OS that must be staked as insurance by Delegations. The initial amount is 250; the amounts that can be voted among are:\n- 75 $OS\n- 250 $OS\n- 500 $OS\n- 750 $OS\n- 1000 $OS\n- 5000 $OS\nLike other survey-less subDAOs, whenever one of these receives the support of 15% of the total $OS supply, it will be implemented.\n**Major Update #3**\nThis will upgrade the Insurance Fund subDAOs to v2.0 of the subDAO Factory model, thus equipping them with the new metadata fields proposed and explained in the minor updates, allowing anyone who proposes to change which tokens are bought and sold by the Fund to explain their motivations.\n**Minor Update**\n- Both Root Layer and Governance Layer proposals will include an additional metadata field in which to convey in-depth proposal information.",
    "motivations": "**Delegations 2.0**\n**Major Update #1**\nResolving an identified vulnerability in the Delegation system\nDuring the development of Delegation logic, we tested the ways a Delegation might attempt to steal grant money, specifically in the context of the EthOS organization, which awards grants based on the support of $OS holders.\nFor example, a cabal of $OS whales might conspire to create a Delegation, attach it to the Organization and vote for it just before the grant window closes and take off with the ETH. Or a grifting Delegation might run on a platform of promises, but not follow through on any, and pocket the money instead.\nAs things are, it is too easy for Delegation to get away with this kind of thing.\nYes, there are some security measures in place; an organization can (for whatever reason, whenever they like) detach a delegation from itself and even ban it from ever reattaching again.\nBut this can be arduous and ineffective. The ban must be proposed at the Root Layer; the vote must be rallied; and the quorum must be reached in a week (or, if we’re lucky, the hard cap in less time).\nPresently, Delegations can steal grant money a lot faster than that.\nFor something like Delegations, which (at least in this stage of development) inherently depend on some level of trust, economic disincentives can help mitigate any of the attendant problems that may arise, and drive things toward a more permissionless state.\nOS-UP#1 will help disincentivize opportunistic grant thieves: to be eligible to compete for an Organization’s grant money, Delegations will have to stake tokens as insurance. Then, if they attempt to orchestrate a heist, and the Organization bans them, the insurance will be burned.\nIn other words, they will have to risk sacrificing a significant amount of their own money.\nLet’s flesh out how this works with a quick example.\n- To become eligible to compete for the EthOS Organization’s grant money, a delegation representative stakes 250 $OS as insurance.\nFollowing this, there can be one of two general outcomes.\n- a) The Delegation acts honestly. for example, by investing the grant money it wins on a hackathon, as promised. Later, it detaches from the Organization, receiving its 250 $OS of insurance back when it does (if it plans to reattach in the future, it can also choose to leave the tokens where they are, for now).\n- b) The delegation acts dishonestly, for example, by spending the grant money on Blockchain Whispers subscriptions for its representatives instead of the hackathon. The Organization bans the Delegation, and the 250 $OS is burned.\n**Minor Updates**\n- The motivation for this should be obvious. We want the EthOS organization to take advantage of any updates we introduce to the protocol.\n- Currently, proposals of all kinds can include dynamic on-chain metadata. Let’s take the EthOS Organization’s quarterly token investment fund as an example. When someone proposes to change which tokens are bought or sold, the proposed new tokens are generated as an on-chain list that is made visible in the proposal and which precludes the publication of any fake metadata. This approach is solid and secure. However, it doesn’t allow for the proposer to give their justification. OS-UP#1 introduces a new metadata field for that purpose; it can also include any additional desired information.\n**EthOS Organization**\n**Major Update #2**\nDecentralizing governance of Delegation insurance among $OS holders\nOur roadmap of gradually decentralizing governance of the EthOS Organization began with the deployment of both the protocol contracts and the beta interface a couple of months ago. It is in line with our vision to confer governance power to $OS holders of not only pre-existing but also any new features that we introduce to the ecosystem. This is one such feature.\n**Major Update #3**\nEnsuring EthOS subDAOs are equipped with new metadata features\nThe justification for this is fairly obvious. We want the EthOS organization to take advantage of any updates we introduce to the protocol.\n**Minor Update**\nThe motivation for this is the same as that for the Delegations minor update.",
    "specification": "**Delegations 2.0**\nMajor & Minor Updates\nTechnical Updates\n- ChangeOrganizationUriProposal (new metadata features)\n- DelegationsManagerAttacherProposal (new additional metadata feature and update to detach permissions)\n- DelegationTransferManagerProposal (new metadata feature)\n- Vote Proposal (new metadata feature)\n- DelegationChangeRulesProposal (new metadata feature and minor issues fix)\n- DelegationTokensManager (ERC20 and ERC1155 minor issues fix)\nEthereansOS Organization DelegationsManager (new Delegations manager with Delegations v2.0 features)\n**EthOS Organization**\nMajor Update #2\nTechnical Updates\n- Delegations Insurance subDAO (new survey-less subDAO for governing Delegation insurance)\nMajor Update #3 & Minor Update\n- ChangeInvestmentsManagerFourTokensFromETHList (new metadata feature)\n- ChangeInvestmentsManagerFiveTokensToETHList (new metadata feature)\n**Code**\nhttps://github.com/EthereansOS/Operating-System-Update-Proposals/tree/main/OS-UP%20%231"
}